# 会员购物时，根据输入积分的不同享受不同的折扣，计算会员购物时获得的折扣输出实付金额
# 会员积分x
# x ＜ 2000   9折
# 2000 ≤ x ＜ 4000  8折
# 4000 ≤ x ＜ 8000  7折
# x ≥ 8000   6折
x = int(input("请输入会员积分："))
if x < 2000:
    print("会员购物时享受9折优惠")
elif 2000 <= x < 4000:
    print("会员购物时享受8折优惠")
elif 4000 <= x < 8000:
    print("会员购物时享受7折优惠")
else:
    print("会员购物时享受6折优惠")

#  按照年龄划分，60以上是老年人,40-60是中年人,20-40青年人,10-20青少年,10岁以下儿童。
age = int(input("请输入年龄："))
if age >= 60:
    print("老年人")
elif age >= 40:
    print("中年人")
elif age >= 20:
    print("青年人")
elif age >= 10:
    print("青少年")
else:
    print("儿童")
